In [1]:
import pandas as pd 
import numpy as np

In [2]:
forum_users = {
    'User ID': np.array([1, 2, 3, 4, 5]),
    'Username': ['vladimer_p', 'jane_smith', 'alex123', 'bob56', 'mark_wilson'],
    'Age': [18, 35, 25, 38, None], 
    'Joined Date': pd.to_datetime(['2032-01-01', '2032-02-15', '2032-04-25', '2032-06-21', '2032-09-15']),
    'Total Posts': [150, 230, 80, 420, 310],
    'Reputation': [500, 720, 200, 940, 500]
}

df = pd.DataFrame(forum_users)
df

   User ID     Username   Age Joined Date  Total Posts  Reputation
0        1   vladimer_p  18.0  2032-01-01          150         500
1        2   jane_smith  35.0  2032-02-15          230         720
2        3      alex123  25.0  2032-04-25           80         200
3        4        bob56  38.0  2032-06-21          420         940
4        5  mark_wilson   NaN  2032-09-15          310         500

In [3]:
df[['Username', 'Age']]

      Username   Age
0   vladimer_p  18.0
1   jane_smith  35.0
2      alex123  25.0
3        bob56  38.0
4  mark_wilson   NaN

In [4]:
df.loc[3]

User ID                          4
Username                     bob56
Age                           38.0
Joined Date    2032-06-21 00:00:00
Total Posts                    420
Reputation                     940
Name: 3, dtype: object

In [5]:
df.loc[2:3]

   User ID Username   Age Joined Date  Total Posts  Reputation
2        3  alex123  25.0  2032-04-25           80         200
3        4    bob56  38.0  2032-06-21          420         940

In [6]:
df.loc[2:3, ['Username', 'Joined Date', 'Reputation']]

  Username Joined Date  Reputation
2  alex123  2032-04-25         200
3    bob56  2032-06-21         940

In [7]:
df.iloc[3]

User ID                          4
Username                     bob56
Age                           38.0
Joined Date    2032-06-21 00:00:00
Total Posts                    420
Reputation                     940
Name: 3, dtype: object

In [8]:
df.loc[2:4]

   User ID     Username   Age Joined Date  Total Posts  Reputation
2        3      alex123  25.0  2032-04-25           80         200
3        4        bob56  38.0  2032-06-21          420         940
4        5  mark_wilson   NaN  2032-09-15          310         500

In [9]:
df.iloc[2:4, 1:4]

  Username   Age Joined Date
2  alex123  25.0  2032-04-25
3    bob56  38.0  2032-06-21

In [10]:
df[df['Age'] >= 25]

   User ID    Username   Age Joined Date  Total Posts  Reputation
1        2  jane_smith  35.0  2032-02-15          230         720
2        3     alex123  25.0  2032-04-25           80         200
3        4       bob56  38.0  2032-06-21          420         940

In [11]:
df['Age'] >= 25

0    False
1     True
2     True
3     True
4    False
Name: Age, dtype: bool

In [12]:
df[df['Total Posts'] >= 300]

   User ID     Username   Age Joined Date  Total Posts  Reputation
3        4        bob56  38.0  2032-06-21          420         940
4        5  mark_wilson   NaN  2032-09-15          310         500

In [13]:
df[df['Reputation'] == 500]

   User ID     Username   Age Joined Date  Total Posts  Reputation
0        1   vladimer_p  18.0  2032-01-01          150         500
4        5  mark_wilson   NaN  2032-09-15          310         500

In [15]:
df[(df['Total Posts'] >= 300) & (df['Age'] >= 25)]

   User ID Username   Age Joined Date  Total Posts  Reputation
3        4    bob56  38.0  2032-06-21          420         940

In [18]:
df[(df['Total Posts'] >= 400) | (df['Age'] <= 25)]

   User ID    Username   Age Joined Date  Total Posts  Reputation
0        1  vladimer_p  18.0  2032-01-01          150         500
2        3     alex123  25.0  2032-04-25           80         200
3        4       bob56  38.0  2032-06-21          420         940